In [69]:
import pandas as pd
import numpy as np

In [70]:
dataset = pd.read_csv("/Users/antoinekrainc/Downloads/train (1).csv")

In [3]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [71]:
del dataset["Name"], dataset["Ticket"], dataset["Cabin"]

In [72]:
del dataset["PassengerId"]

In [8]:
dataset.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [11]:
dataset.isnull().any()

Survived    False
Pclass      False
Sex         False
Age          True
SibSp       False
Parch       False
Fare        False
Embarked     True
dtype: bool

In [14]:
dataset.isnull().sum()/len(dataset)

Survived    0.000000
Pclass      0.000000
Sex         0.000000
Age         0.198653
SibSp       0.000000
Parch       0.000000
Fare        0.000000
Embarked    0.002245
dtype: float64

In [21]:
dataset.dropna().head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [73]:
dataset = dataset.fillna(dataset.median())

In [28]:
dataset.isnull().any()

Survived    False
Pclass      False
Sex         False
Age         False
SibSp       False
Parch       False
Fare        False
Embarked     True
dtype: bool

In [74]:
dataset = dataset.fillna("Unknown")

In [40]:
dataset = dataset.interpolate()

In [43]:
dataset.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [75]:
dataset = pd.get_dummies(dataset, drop_first = True)

In [47]:
dataset.head()

,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Embarked_Unknown
0,0,3,22.0,1,0,7.2500,1,0,1,0
1,1,1,38.0,1,0,71.2833,0,0,0,0
2,1,3,26.0,0,0,7.9250,0,0,1,0
3,1,1,35.0,1,0,53.1000,0,0,1,0
4,0,3,35.0,0,0,8.0500,1,0,1,0

In [76]:
y = dataset.Survived
X = dataset.loc[:, dataset.columns!="Survived"]

In [50]:
X.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_male,Embarked_Q,Embarked_S,Embarked_Unknown
0,3,22.0,1,0,7.2500,1,0,1,0
1,1,38.0,1,0,71.2833,0,0,0,0
2,3,26.0,0,0,7.9250,0,0,1,0
3,1,35.0,1,0,53.1000,0,0,1,0
4,3,35.0,0,0,8.0500,1,0,1,0

In [51]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [77]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
X = sc_x.fit_transform(X)

In [103]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, 
                                                    y,
                                                    test_size=0.25,
                                                    random_state=0
                                                    )

In [104]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier.fit(X_train, y_train)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [105]:
classifier.score(X_test,y_test)

0.7937219730941704

In [106]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
ds = pd.read_csv('/Users/antoinekrainc/Downloads/train (1).csv')
dataset = pd.DataFrame(ds)
#plt.scatter(dataset.Age,dataset.Survived)
dataset['Civ'] = dataset['Name'].str.split(',').str[1].str.split('.').str[0]
#dataset['Name_len'] = dataset['Name'].str.len()
#dataset['Pre_name'] = dataset['Name'].str.split(',').str[0]
dataset['Cabin_type'] = dataset.Cabin.loc[:].str[0]
#dataset['Ticket1'] = dataset['Ticket'].str.split('/').str[0]#dataset['Cabin_number'] = dataset.Cabin.loc[:].str[1:]
#dataset.corr()
dataset['Familly_number'] = dataset.SibSp + dataset.Parch
dataset = dataset.drop(['Name','PassengerId','Cabin','Ticket','SibSp','Parch','Fare'], axis=1)
dataset = dataset.fillna(dataset.mean()) 
dataset = dataset.fillna("Unknown")
dataset=pd.get_dummies(dataset,drop_first=True)
y=dataset.Survived
X=dataset.loc[:,dataset.columns!='Survived']
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
sc_x.fit(X)
X = sc_x.transform(X)
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,
                                                    y,
                                                   test_size=.25,
                                                   random_state = 0)

from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier.fit(X_train,y_train)

classifier.score(X_train,y_train)

classifier.score(X_test,y_test)

0.8340807174887892

In [107]:
classifier.score(X_train,y_train)

0.8398203592814372

In [109]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import train_test_split

dataset = pd.read_csv("/Users/antoinekrainc/Downloads/train (1).csv")
def tick(x):
    try:
        float(x)
        return 1
    except:
        return 0
    
def title_extr(x):
    Title_list = ["Mrs.", 
                  "Mr.", 
                  "Miss.", 
                  "Master.", 
                  "Don.", 
                  "Rev.", 
                  "Dr.", 
                  "Mme.", 
                  "Major.", 
                  "Ms.", 
                  "Lady.", 
                  "Sir.", 
                  "Col.", 
                  "Mlle.", 
                  "Capt.", 
                  "Countess."]
    for items in Title_list:
        if items in str(x):
            result = items
            break
        else:
            result = "Other"
    return result

dataset["Cabin_01"] = dataset.Cabin.apply(lambda x: str(x)[0].upper())
dataset["Cabin_01"] = dataset.Cabin_01.apply(lambda x: 0 if x == "N" else 1)
dataset["Ticket_01"] = dataset.Ticket.apply(lambda x: tick(x))
dataset["title"] = dataset.Name.apply(lambda x: title_extr(x))
# controle titres manquants
dataset.groupby("Cabin_01").sum()
del dataset["Name"], dataset["Ticket"], dataset["Cabin"], dataset["PassengerId"],

# try with average per class
#list_class = [1,2,3]
#for items in list_class:
#    dataset.loc[dataset.Pclass == items] = dataset.fillna(dataset.loc[dataset.Pclass == items].median())

# try with interpolate
# dataset = dataset.interpolate()
dataset = dataset.fillna(dataset.median())
dataset = dataset.fillna("unknown")

#dataset = dataset[dataset.Fare.astype(float) < 400]
 
dataset = pd.get_dummies(dataset, drop_first = True)
y = dataset.Survived
X = dataset.loc[:, dataset.columns != "Survived"]

src_x = StandardScaler()
src_x.fit(X)
X = src_x.transform(X)
XDF = pd.DataFrame(X)


X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = .25, random_state=0)

classifier = LogisticRegression()
classifier.fit(X_train,y_train)

classifier.score(X_test,y_test)

0.820627802690583

In [110]:
import numpy as np
import pandas as pd

# Import data
dataset = pd.read_csv("/Users/antoinekrainc/Downloads/train (1).csv")

# Suppression des colonnes inutiles
del dataset["PassengerId"], dataset["Embarked"]

# Fill empty values on columns with float values
dataset = dataset.interpolate()

# Format /Cabin/
dataset.Cabin = dataset.Cabin.fillna("U")
dataset.Cabin = dataset.Cabin.apply(lambda x: 1 if x!="U" else 0)

# Format /SibSp/
dataset.SibSp = dataset.SibSp.apply(lambda x: 0 if x==0 else 1)

# Format /Name/
dataset.Name = dataset.Name.apply(lambda x: x.split(" ")[1][:-1])
dataset.Name = dataset.Name.apply(lambda x: x if x in ["Master","Miss","Mr","Mrs"] else "U")

# Format /Age/
dataset.Age = dataset.Age.apply(lambda x: "E" if x<16 else "A")

#Format /Ticket/
dataset.Ticket = dataset.Ticket.apply(lambda x: x[:1] if str(x[:1])else "U")

# Dummy variables
dataset = pd.get_dummies(dataset, drop_first=True)

# dataset.head(10)

# Target and X 
y = dataset.Survived
X = dataset.loc[:,dataset.columns!="Survived"]

# Normalisation
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
X = sc_x.fit_transform(X)

# Split data
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.25, random_state=0)

# RÃ©gression
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression()
classifier.fit(X_train, y_train)
classifier.score(X_test, y_test)

0.8430493273542601

In [112]:
classifier.score(X_train, y_train)

0.8353293413173652